Qala_Mobile_app/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПоставщику</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>155</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодтвержедия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Qala_Mobile_app/src/Documents/ЗаказПоставщику/ObjectModule.bsl
Перем ЗначениеСтатуса;
Перем ЗначениеДатаПодтвержедия;
Перем ЗначениеКомментарий;

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
			
	ЗначениеСтатуса = Ссылка.Статус;
	ЗначениеДатаПодтвержедия = Ссылка.ДатаПодтвержедия;
	ЗначениеКомментарий = Ссылка.Комментарий;
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда 
		Возврат;
	КонецЕсли;
	
	ОбъектИзменен = Ложь;
	Если ЗначениеСтатуса <> Статус Тогда 
		ОбъектИзменен = Истина;
	КонецЕсли;	
	
	Если ЗначениеДатаПодтвержедия <> ДатаПодтвержедия Тогда 
		ОбъектИзменен = Истина;
	КонецЕсли;	
	
	Если ЗначениеКомментарий <> Комментарий Тогда 
		ОбъектИзменен = Истина;
	КонецЕсли;	
	
	Если ОбъектИзменен Тогда 
		
		Выборка = ПланыОбмена.МобОбмен.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Ссылка = ПланыОбмена. МобОбмен.ЭтотУзел() Тогда
				Продолжить;
			КонецЕсли; 
			
			ПланыОбмена.ЗарегистрироватьИзменения(Выборка.Ссылка, Ссылка);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
